Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
pd.read_excel('list-national-capitals.xls')    # Reads the excel file and similarly can able to read CSV and other formats

,SNo,Country,Capital City,Notes
0,1,United Arab Emirates,Abu Dhabi,NaN
1,2,Nigeria,Abuja,NaN
2,3,Ghana,Accra,NaN
3,4,Pitcairn Islands,Adamstown,British Overseas Territory
4,5,Ethiopia,Addis Ababa,NaN
...,...,...,...,...
258,244,Croatia,Zagreb,NaN
259,NaN,NaN,NaN,NaN
260,For other more formats kindly visit www.downlo...,NaN,NaN,NaN
261,NaN,NaN,NaN,NaN
262,Original source : en.wikipedia.org/wiki/List_o...,NaN,NaN,NaN

In [2]:
excel = pd.read_excel('list-national-capitals.xls')
excel.describe()   # Gives the details description of the table

        SNo                Country Capital City                       Notes
count   246                    244          259                          62
unique  246                    244          256                          33
top       1   United Arab Emirates      Nicosia  British Overseas Territory
freq      1                      1            2                          10

In [3]:
excel.head(10) #Reads the data of first 10 rows

,SNo,Country,Capital City,Notes
0,1,United Arab Emirates,Abu Dhabi,NaN
1,2,Nigeria,Abuja,NaN
2,3,Ghana,Accra,NaN
3,4,Pitcairn Islands,Adamstown,British Overseas Territory
4,5,Ethiopia,Addis Ababa,NaN
5,6,Algeria,Algiers,NaN
6,7,Niue,Alofi,Self-governing in free association with New Ze...
7,8,Jordan,Amman,NaN
8,9,Netherlands,Amsterdam,The Dutch constitution refers to Amsterdam as ...
9,10,Andorra,Andorra la Vella,NaN

In [4]:
excel.tail(10)  #Reads the data of last 10 rows

,SNo,Country,Capital City,Notes
253,240,Ivory Coast,Yamoussoukro (official),NaN
254,NaN,NaN,Abidjan (former capital; still has many govern...,NaN
255,241,Cameroon,Yaoundé,NaN
256,242,Nauru,Yaren (de facto),Country does not have an official capital; how...
257,243,Armenia,Yerevan,NaN
258,244,Croatia,Zagreb,NaN
259,NaN,NaN,NaN,NaN
260,For other more formats kindly visit www.downlo...,NaN,NaN,NaN
261,NaN,NaN,NaN,NaN
262,Original source : en.wikipedia.org/wiki/List_o...,NaN,NaN,NaN

In [5]:
 excel.columns # Gives the column name in the excel

Index(['SNo', 'Country', 'Capital City', 'Notes'], dtype='object')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [30]:
Table = {"A":["Arun","Bharath","chidambaram"],"B":[25,26,27],"C":["covai","chennai","tiruchi"]}

#a= pd.DataFrame(Table,index = ["1", "3", "5"])
#print(a)
def index_func(n):
    x = 1
    ls=[]
    for i in range(0,n):
        x = 2*i + 1
        ls.append(x)
    return ls
    print(ls)
a= pd.DataFrame(Table,index = index_func(3))
print(a)

             A   B        C
1         Arun  25    covai
3      Bharath  26  chennai
5  chidambaram  27  tiruchi

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [26]:
Table ={"values": [10, 20, 30, 40, 50]}
b = pd.DataFrame(Table)

print("The sum of first three values are  {}".format(b['values'][0:3].sum()))

The sum of first three values are  60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [9]:
Table1 ={"name": ["raju","sita","ram","harikumar","saravanan"]}
b = pd.DataFrame(Table1)
len(b["name"])
b["Word_count"] = b['name'].apply(len)
print(b)

        name  Word_count
0       raju           4
1       sita           4
2        ram           3
3  harikumar           9
4  saravanan           9

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() - Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
DataFrame.shape() - Returns tuple of shape (Rows, columns) of dataframe/series

Q6. Which function of pandas do we use to read an excel file?

Ans6 : pandas.read_excel("name.xls")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [38]:
a=pd.DataFrame({"Email":['John.doe@example.com','sample@example.com']})
a["username"]=a["Email"].str.split("@").str[0]
print (a)

                  Email  username
0  John.doe@example.com  John.doe
1    sample@example.com    sample

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [40]:
b= pd.DataFrame({"A":[3,8,6,2,9],
                 "B":[5,2,9,3,1],
                 "C":[1,7,4,5,2]
                })

In [54]:
b[(b["A"]>5) & (b["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [61]:
df = pd.DataFrame({"Values":[2,4,5,6,7,8]})
print(df["Values"].mean())
print(df["Values"].median())
df["Values"].std()

5.333333333333333
5.5

2.160246899469287

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [76]:
sales= [150,100,120,160,180,200,520,260,200,100,150]
#date = pd.date_range(start='23-02-2023',end = '06-03-2023')
data = pd.date_range(start = '2023-02-24' ,end = '2023-03-06')
table = pd.DataFrame({"Sales":sales,"Date":data})
table["Moving_avg"]= table["Sales"].rolling(window=7).mean()
print (table)

    Sales       Date  Moving_avg
0     150 2023-02-24         NaN
1     100 2023-02-25         NaN
2     120 2023-02-26         NaN
3     160 2023-02-27         NaN
4     180 2023-02-28         NaN
5     200 2023-03-01         NaN
6     520 2023-03-02  204.285714
7     260 2023-03-03  220.000000
8     200 2023-03-04  234.285714
9     100 2023-03-05  231.428571
10    150 2023-03-06  230.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [78]:
table["weekday"]=table["Date"].dt.day_name()
print (table)

    Sales       Date  Moving_avg    weekday
0     150 2023-02-24         NaN     Friday
1     100 2023-02-25         NaN   Saturday
2     120 2023-02-26         NaN     Sunday
3     160 2023-02-27         NaN     Monday
4     180 2023-02-28         NaN    Tuesday
5     200 2023-03-01         NaN  Wednesday
6     520 2023-03-02  204.285714   Thursday
7     260 2023-03-03  220.000000     Friday
8     200 2023-03-04  234.285714   Saturday
9     100 2023-03-05  231.428571     Sunday
10    150 2023-03-06  230.000000     Monday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [87]:
date2 = pd.date_range(start = '2022-12-24' ,end = '2023-02-06')
a= pd.DataFrame({'Date':date2})
a[(a["Date"]>"2022-12-31")&(a["Date"]<"2023-01-31")]

         Date
8  2023-01-01
9  2023-01-02
10 2023-01-03
11 2023-01-04
12 2023-01-05
13 2023-01-06
14 2023-01-07
15 2023-01-08
16 2023-01-09
17 2023-01-10
18 2023-01-11
19 2023-01-12
20 2023-01-13
21 2023-01-14
22 2023-01-15
23 2023-01-16
24 2023-01-17
25 2023-01-18
26 2023-01-19
27 2023-01-20
28 2023-01-21
29 2023-01-22
30 2023-01-23
31 2023-01-24
32 2023-01-25
33 2023-01-26
34 2023-01-27
35 2023-01-28
36 2023-01-29
37 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

We need to import pandas library initially to do all the basic functions in pandas
mport pandas as name